import convert
import sys

print("-----------------------------------------------------------------------------------------------------------------------")
print("                                           欢迎来到车辆行驶情况转换程序主界面")
print("-----------------------------------------------------------------------------------------------------------------------","\n")

print("功能选择按键说明：")
print("1：计算车辆的平均行车速度")
print("2：计算车辆的行车里程")
print("3：生成车辆的行驶路线图（html文件）")
print("4：生成车辆的带有速度标记点的路线图（html文件）")
print("5：生成车辆的带有加速度标记点的路线图（html文件）")
print("6：查询车辆的不良驾驶行为","\n")

file_path=input("请输入存储车辆采集数据的csv文件所在位置（例如：E:\data\csv_file）：")
file_name=input("请输入您想转换的车辆的车辆号码（例如：AA00002）：")
print("")   #换行

con_quit='c'

while con_quit=='c':
	con_quit_a=convert.execute(file_path,file_name)      #获取用户输入的指令
	con_quit=con_quit_a





